vpcola/stm32f4/EmbestNoEth/Src/ov9655.c
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "ov9655.h"
#include "dcmi.h"
#include "i2c.h"
#include "dma.h"
#include "FreeRTOS.h"


#define I2C_CAM_TIMEOUT 1000
#define TIMEOUT         10

uint8_t SingleRandomWrite(uint8_t Device, uint16_t Addr, uint8_t Data)
{
    if (HAL_I2C_Mem_Write(&hi2c1, 
                Device,
                (uint8_t) Addr, // register address
                1, // sizeof (Addr)
                &Data,
                sizeof(Data),
                I2C_CAM_TIMEOUT ) == HAL_OK)
        return 0x00;
    else
        return 0xFF;
}

uint8_t SingleRandomRead(uint8_t Device, uint16_t Addr)
{
    uint8_t data = 0;

    if (HAL_I2C_Mem_Read(&hi2c1,
                Device,
                (uint8_t) Addr,
                1, // sizeof(uint8_t)
                &data,
                sizeof(data),
                I2C_CAM_TIMEOUT) == HAL_OK)
        return data;
    else
        return 0xFF;
}

void nDelay(uint32_t n)
{
    int i;
    if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
    {
        // delay in MS
        osDelay(n);
    }else
    {
        for(i = 0; i < n; i++);
    }
}


void OV9655_SetupCamera(CapImageSize size)
{
}

/**
 * @brief  Reset the OV9655 SCCB registers.
 * @param  None
 * @retval None
 */
void OV9655_Reset(void)
{
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS, OV9655_COM7, SCCB_REG_RESET);    
}

/**
 * @brief  Set the QVGA size(240*320).
 * @param  None
 * @retval None
 */
void OV9655_QVGASizeSetup(void)
{  
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x00, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x01, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x02, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x03, 0x02);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x04, 0x03);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x09, 0x01);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x0b, 0x57);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x0e, 0x61);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x0f, 0x40);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x11, 0x01);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x12, 0x62);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x13, 0xc7);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x14, 0x3a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x16, 0x24);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x17, 0x18);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x18, 0x04);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x19, 0x01);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x1a, 0x81);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x1e, 0x00); /*0x20*/
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x24, 0x3c);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x25, 0x36);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x26, 0x72);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x27, 0x08);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x28, 0x08);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x29, 0x15);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x2a, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x2b, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x2c, 0x08);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x32, 0x12); // 0x32, 0xa4 for half res
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x33, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x34, 0x3f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x35, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x36, 0x3a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x38, 0x72);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x39, 0x57);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x3a, 0xcc);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x3b, 0x04);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x3d, 0x99);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x3e, 0x02);  //0x3e, 0x0e for half res
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x3f, 0xc1);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x40, 0xc0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x41, 0x41);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x42, 0xc0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x43, 0x0a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x44, 0xf0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x45, 0x46);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x46, 0x62);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x47, 0x2a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x48, 0x3c);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4a, 0xfc);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4b, 0xfc);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4c, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4d, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4e, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x4f, 0x98);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x50, 0x98);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x51, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x52, 0x28);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x53, 0x70);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x54, 0x98);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x58, 0x1a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x59, 0x85);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5a, 0xa9);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5b, 0x64);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5c, 0x84);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5d, 0x53);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5e, 0x0e);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x5f, 0xf0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x60, 0xf0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x61, 0xf0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x62, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x63, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x64, 0x02);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x65, 0x20);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x66, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x69, 0x0a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x6b, 0x5a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x6c, 0x04);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x6d, 0x55);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x6e, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x6f, 0x9d);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x70, 0x21);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x71, 0x78);
    nDelay(TIMEOUT);
    nDelay(TIMEOUT);  
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x72, 0x11); // 0x72, 0x22 for half res
    nDelay(TIMEOUT);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x73, 0x01); // 0x73, 0x02 for half res
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x74, 0x10); 
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x75, 0x10); 
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x76, 0x01);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x77, 0x02);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7A, 0x12);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7B, 0x08);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7C, 0x16);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7D, 0x30);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7E, 0x5e);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x7F, 0x72);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x80, 0x82);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x81, 0x8e);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x82, 0x9a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x83, 0xa4);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x84, 0xac);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x85, 0xb8);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x86, 0xc3);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x87, 0xd6);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x88, 0xe6);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x89, 0xf2);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x8a, 0x24);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x8c, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x90, 0x7d);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x91, 0x7b);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x9d, 0x02);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x9e, 0x02);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0x9f, 0x7a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa0, 0x79);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa1, 0x40);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa4, 0x50);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa5, 0x68);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa6, 0x4a);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa8, 0xc1);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xa9, 0xef);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xaa, 0x92);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xab, 0x04);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xac, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xad, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xae, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xaf, 0x80);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb2, 0xf2);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb3, 0x20);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb4, 0x20);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb5, 0x00);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb6, 0xaf);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xb6, 0xaf);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbb, 0xae);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbc, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbd, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbe, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbf, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xbf, 0x7f);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc0, 0xaa);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc1, 0xc0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc2, 0x01);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc3, 0x4e);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc6, 0x05);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc7, 0x81); // 0xc7, 0x82 for half res
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xc9, 0xe0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xca, 0xe8);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xcb, 0xf0);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xcc, 0xd8);
    nDelay(TIMEOUT);
    SingleRandomWrite(OV9655_DEVICE_WRITE_ADDRESS,0xcd, 0x93);
    nDelay(TIMEOUT);
}

